reddit_joke_book/app/controllers/jokes_controller.rb

SELECT "jokes".* FROM "jokes"
---
  def index
  	@jokes = Joke.all

SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
  	@joke = Joke.find_by(id: params['id'])

INSERT INTO "jokes" ("created_at", "updated_at", "body", "author") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2018-04-05 00:46:04.452120"], ["updated_at", "2018-04-05 00:46:04.452120"], ["body", "i have joke"], ["author", "hani"]]
---
  def create
  	joke = params['joke']
  	Joke.create(author: joke['author'], body: joke['body'])

SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "jokes" SET "body" = $1, "updated_at" = $2 WHERE "jokes"."id" = $3  [["body", "this is a reallllly good joke"], ["updated_at", "2018-04-05 00:58:46.430063"], ["id", 12]]
---
  def update
  	joke = params['joke']
  	joke_to_edit = Joke.find(params[:id])
  	joke_to_edit.update(author: joke['author'], body: joke['body'])

DELETE FROM "jokes" WHERE "jokes"."id" = $1  [["id", 3]]
---
  def destroy
  	Joke.destroy(params['id'])

INSERT INTO "jokes" ("created_at", "updated_at", "body", "author") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2018-04-04 18:33:33.937808"], ["updated_at", "2018-04-04 18:33:33.937808"], ["body", "Hey, I'm the chief here. Bake him away, toys."], ["author", "Chief Wiggum"]]
---
  def get_rand
    data = HTTParty.get "https://api.pushshift.io/reddit/comment/search?q=%22knock%20knock%22-sex&limit=1000&score=>1000&subreddit=askreddit"
    randomJoke = rand(0...200)
    author = data['data'][randomJoke]['author']
    joke = data['data'][randomJoke]['body']
    # render json: {author: author, body: body}
    Joke.create(author: author, body: joke)